module.exports.config = {
  name: "goiadmin",
  version: "1.0.0",
  hasPermssion: 0,
  credits: "𝐏𝐫𝐢𝐲𝐚𝐧𝐬𝐡 𝐑𝐚𝐣𝐩𝐮𝐭",
  description: "Bot will rep ng tag admin or rep ng tagbot ",
  commandCategory: "Other",
  usages: "",
  cooldowns: 1
};
module.exports.handleEvent = function({ api, event }) {
  if (event.senderID !== "100062282613155") {
    var aid = ["100062282613155"];
    for (const id of aid) {
    if ( Object.keys(event.mentions) == id) {
      var msg = ["💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴\n\n𝚈𝙰𝚁 𝙺𝚁𝙸𝚂𝙷𝙽𝙰 𝙱𝙰𝙱𝚄 𝙺𝙾 𝙼𝙴𝙽𝚃𝙾𝙽 𝙺𝙰𝚁 𝚁𝙴𝙷𝙴 𝙷𝙾 𝚄𝚂𝙴 𝙱𝚄𝚁𝙰 𝙼𝙰𝙽 𝙹𝙰𝚈𝙴𝙶𝙰\n\n💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴", "💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴\n\n𝙱𝙷𝙰𝙶 𝙹𝙰 𝚃𝙷𝙰𝚁𝙺𝙸 𝙼𝙴𝚁𝙴 𝙱𝙾𝚂𝚂 𝙺𝚁𝙸𝚂𝙷𝙽𝙰 𝙺𝙾 𝙺𝚈𝚄 𝙿𝙰𝚁𝙴𝚂𝙷𝙽𝙰 𝙺𝙰𝚁 𝚁𝙴𝙷𝙴 𝙷𝙾\n\n💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴" , "💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴\n\n𝚆𝙾 𝙰𝙱𝙷𝙸 𝙺𝚄𝙲𝙷 𝙺𝙰𝙼 𝙼𝙴 𝙱𝚄𝚂𝚈 𝙷𝙾𝙽𝙶𝙴 𝙼𝚄𝙹𝙷𝙴 𝙱𝙾𝙻𝙾 𝙼𝙴 𝙱𝙾𝙻 𝙳𝚄𝙽𝙶𝙰 𝙰𝙰𝙿𝙽𝙴 𝙱𝙾𝚂𝚂 𝚂𝙴\n\n💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴", "💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴\n\n𝙺𝚈𝙰 𝙷𝚄𝙰 𝙼𝙴𝚁𝙸 𝙹𝙰𝙰𝙽 𝙺𝚈𝙾 𝚈𝙰𝙳 𝙰𝙰 𝙶𝚈𝙸 𝙼𝙴𝚁𝙴 𝙱𝙾𝚂𝚂 𝙺𝙸\n\n💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴", "💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴\n\n𝙰𝙱𝙷𝙸 𝙺𝚁𝙸𝚂𝙷𝙼𝙰 𝙺𝙰 𝙺𝙷𝙰𝙽𝙴 𝙺𝙰 𝚃𝙸𝙼𝙴 𝙷𝙴 𝚄𝚂𝙴 𝙿𝙰𝚃𝙴𝚂𝙷𝙽𝙰 𝙼𝙰𝚃 𝙺𝙰𝚁𝙾\n\n💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴", "💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴\n\n𝚃𝚄𝙼 𝙻𝙾𝙶𝙾 𝙺𝙴 𝚂𝙰𝙼𝙰𝙹𝙷 𝙼𝙴 𝙽𝙷𝙸 𝙰𝙰𝚃𝙰 𝙷𝙰𝙸 𝙺𝚈𝙰 𝙺𝚈𝙾 𝙿𝙰𝚁𝙴𝚂𝙷𝙰𝙽 𝙺𝙰𝚁 𝚁𝙴𝙷𝙴 𝙷𝙾 𝙱𝙾𝚂𝚂 𝙺𝙾 𝚃𝙷𝙰𝚁𝙺𝙸 𝙻𝙾𝙶\n\n💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴","💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴\n\n𝙰𝙱𝙷𝙸 𝙱𝙾𝚂𝚂 𝙴𝙺 𝙻𝙾𝚅𝙴 𝚂𝚃𝙾𝚁𝚈 𝙻𝙸𝙺𝙷𝙽𝙴 𝙼𝙴 𝙱𝚄𝚂𝚈\n\n💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴","💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴\n\n𝙷𝙰𝙳 𝙷𝙾𝚃𝙸 𝙷𝙰𝙸 𝚈𝙰𝚁 𝙰𝙱𝙷𝙸 𝙰𝙱𝙷𝙸 𝙼𝙴𝚁𝙴 𝙱𝙾𝚂𝚂 𝙱𝙰𝙷𝙰𝚁 𝙶𝙷𝚄𝙼𝙽𝙴 𝙺𝙴 𝙻𝙸𝚈𝙴 𝙶𝙰𝚈𝙴 𝙷𝙴 𝙱𝚄𝚃 𝙰𝙰𝙿 𝙻𝙾𝙶 𝙽𝙷𝙸 𝙶𝙷𝚄𝙼𝙽𝙴 𝙳𝙴𝚃𝙴 𝚄𝚂𝙴\n\n💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴", "💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴\n\n𝙹𝙰 𝙿𝙷𝙴𝙻𝙴 𝙽𝙰𝙷𝙰 𝙺𝙰𝚁 𝙹𝙾 𝙽𝙰𝙷𝚃𝙴 𝙽𝙷𝙸 𝚄𝚂𝙴 𝙼𝙴𝚁𝙴 𝙱𝙾𝚂𝚂 𝙱𝙰𝙰𝚃 𝙽𝙷𝙸 𝙺𝙰𝚁𝚃𝙴\n\n💖🌿🪻☆｡･::･ﾟ★,｡･::･ﾟ☆💥☆｡･::･ﾟ★,｡･::･ﾟ☆🌸🌴"];
      return api.sendMessage({body: msg[Math.floor(Math.random()*msg.length)]}, event.threadID, event.messageID);
    }
    }}
};
module.exports.run = async function({}) {
}
